cukier/Mems/firmware/sdkconfig.defaults
# ESP-IDF project defaults for the INVOKE Band firmware.
# See firmware/main/invoke_ble.c and docs/INVOKE_BLE_ESPECIFICACAO.md.

CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_HZ=1000

# BLE (NimBLE): peripheral (NUS GATT to the teacher app) + broadcaster +
# observer (BLE 5 extended-advertising mesh for the round chunks), all at once.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_MAX_BONDS=0
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512

# BLE 5.0 extended advertising: instance 0 = legacy connectable (NUS UUID +
# name for the Chrome picker), instance 1 = extended non-connectable, carries
# the chunked question/answer frames. Extended scan comes with EXT_ADV.
CONFIG_BT_LE_50_FEATURE_SUPPORT=y
CONFIG_BT_NIMBLE_EXT_ADV=y
CONFIG_BT_NIMBLE_MAX_EXT_ADV_INSTANCES=2
CONFIG_BT_NIMBLE_EXT_ADV_MAX_SIZE=512

# No host-based privacy / RPA. on_sync() sets a fresh static random address
# per boot and there is no bonding (MAX_BONDS=0); the half-initialised privacy
# machinery otherwise breaks connection establishment intermittently (0x3e).
CONFIG_BT_NIMBLE_HS_PVCY=n

# Every mesh relay matters — the controller must not dedupe scan results.
CONFIG_BT_CTRL_BLE_SCAN_DUPL=n
